# View Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewPrintedEventArgs..::..View Property
ViewPrintedEventArgs Class See Also
---
The view that was printed.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public View View { get; }
```

Visual Basic
---
```text
Public ReadOnly Property View As View
	Get
```

Visual C++
---
```text
public:
property View^ View {
	View^ get ();
}
```

# See Also
ViewPrintedEventArgs Class
Autodesk.Revit.DB.Events Namespace